import { useNavigate } from "react-router-dom";

import "./About.css";

const About = () => {
    const navigate = useNavigate();

    const onContactButtonHandler = () => {
        navigate("/contact");
    };

    return (
        <div className="about">
            SSG Build е компяния която се занимава с реновиране и ремонти на
            апартаменти, къщи и бизнес помещения. След дългогодишен опит на
            Немският пазар, реших да пренеса това на Българският Пазар. За мен
            клиента е най-важен и се стремя да изпълня всички негови желания за
            реновиране или ремонти. По конкретно се занимавам с ГипсКартон
            конструкции , мазилки , Електрически решения, водопроводни услуги и
            др. Предлагам на клиента професионална помощ, голям избор от
            конкретни решения, огромна гама от продукти и предложения за
            професионално решение на всички въпроси и проблеми. При мен
            работният процес е транспарентен и клиента участва във всички
            процеси, от плануване през контрол на качеството по време на работа
            до завършеният вид на проекта.
            <div>
                <p>Имате още въпроси?</p>
                <p>Искате да се консултирате с Мен?</p>
                <p>Или просто искате да кажете Здрасти?</p>
            </div>
            <button
                onClick={onContactButtonHandler}
                className="contactMeButton"
            >
                Свържете се с Мен
            </button>
        </div>
    );
};

export default About;
